# LAB 04 - Data preprocessing

## 02 행 기준 병합

### #01.준비작업

In [2]:
#패키지 참조
from pandas import DataFrame
from pandas import concat

In [4]:
#샘플 데이터 생성
df1 = DataFrame({'이름':['영희','철수'],'국어':[87,91]})
df1

   이름  국어
0  영희  87
1  철수  91

In [6]:
#샘플 데이터 생성
df2 = DataFrame({'이름':['민철','수현'],'국어':[78,92]})
df2

   이름  국어
0  민철  78
1  수현  92

### #02.concat() 함수의 기본 사용 방법
- 병합할 데이터 프레임을 리스트로 묶는다
- 2개 이상의 데이터 프레임도 concat 함수를 쓸 수 있다
- 각 데이터 프레임이 갖고 있던 인덱스가 그대로 유지되면서 인덱스 중복이 발생할 수 있다. 이 점에 대해선 특정 옵션을 사용해줘야한다

In [8]:
concat([df1,df2])

   이름  국어
0  영희  87
1  철수  91
0  민철  78
1  수현  92

In [9]:
concat([df1,df2],ignore_index=True)

   이름  국어
0  영희  87
1  철수  91
2  민철  78
3  수현  92

### #03.서로 다른 변수를 갖는 데이터 프레임의 병합

In [10]:
df3 = DataFrame({'이름':['영희','철수'],'국어':[87,91]})
df3

   이름  국어
0  영희  87
1  철수  91

In [11]:
df4=DataFrame({'이름':['민철','수현'],'수학':[78,92]})
df4

   이름  수학
0  민철  78
1  수현  92

In [12]:
concat([df3,df4],ignore_index=True)

   이름    국어    수학
0  영희  87.0   NaN
1  철수  91.0   NaN
2  민철   NaN  78.0
3  수현   NaN  92.0

### #04.인덱스를 갖는 데이터 프레임의 병합

In [14]:
df5=DataFrame({'국어':[87,91,85]},
              index=['영희','철수','민수'])

df5

    국어
영희  87
철수  91
민수  85

In [16]:
df6 = DataFrame({'국어':[78,92,82]},index=['민철','수현','민수'])

In [ ]:
#인덱스도 함께 병합
concat([df5,df6])

    국어
영희  87
철수  91
민수  85
민철  78
수현  92
민수  82

In [19]:
#인덱스 제외하고 병합하기
concat([df5,df6],ignore_index=True)

   국어
0  87
1  91
2  85
3  78
4  92
5  82